#Practice Case - Machine Learning
Stella Linda Cyrilla

## Import Libraries

In [68]:
import pandas as pd
import seaborn as sns
from sklearn import preprocessing

## Load dataset in CSV format from URL

In [69]:

file_loc="/content/ML_2_Fellow.csv"

#download the csv file from URL and create the dataframe
df_raw=pd.read_csv(file_loc, encoding= 'unicode_escape')
df_raw.head()

  Kode_Bayar Kode_Barang  ... Kode_Pelanggan          Negara
0     536365      85123A  ...        17850.0  United Kingdom
1     536365       71053  ...        17850.0  United Kingdom
2     536365      84406B  ...        17850.0  United Kingdom
3     536365      84029G  ...        17850.0  United Kingdom
4     536365      84029E  ...        17850.0  United Kingdom

[5 rows x 8 columns]

## Data Preprocessing

In [70]:
#drop duplicates
df_raw= df_raw.drop_duplicates()

#Check 'Jumlah' values
df_raw.reset_index().sort_values(['Jumlah'],ascending=True)

       index  ...          Negara
4226    4287  ...  United Kingdom
21200  21518  ...  United Kingdom
7190    7292  ...  United Kingdom
19681  19996  ...  United Kingdom
4778    4857  ...  United Kingdom
...      ...  ...             ...
24549  24901  ...             NaN
24550  24902  ...             NaN
24551  24903  ...             NaN
24552  24904  ...             NaN
24553  24905  ...             NaN

[24643 rows x 9 columns]

Since 'Jumlah' has to be positive value, we should remove all rows that have non-positive values in 'Jumlah'

In [71]:
#take only rows with positive values in Jumlah
df=df_raw[(df_raw['Jumlah'] > 0)]

## Remove all rows with NaN (missing) values 
df.isnull().sum(axis=0)
df.dropna(subset=['Barang','Kode_Pelanggan','Jumlah','Tanggal_Transaksi','Harga_Satuan' ,'Negara' ], inplace=True)
df.isnull().sum(axis=0)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

Kode_Bayar           0
Kode_Barang          0
Barang               0
Jumlah               0
Tanggal_Transaksi    0
Harga_Satuan         0
Kode_Pelanggan       0
Negara               0
dtype: int64

## 1.	What items customers buy the most and are there any items we should ignore?

In [72]:
# 1 .Find the most bought items
new_df = df.groupby(["Kode_Barang","Barang"])['Jumlah'].sum()
new_df.reset_index().sort_values(['Jumlah'],ascending=False).head(5)

     Kode_Barang                              Barang  Jumlah
1672       84077   WORLD WAR 2 GLIDERS ASSTD DESIGNS  3792.0
822        22189             CREAM HEART CARD HOLDER  2154.0
821        22188             BLACK HEART CARD HOLDER  2126.0
1045       22492             MINI PAINT SET VINTAGE   2114.0
1906      85123A  WHITE HANGING HEART T-LIGHT HOLDER  1915.0

In [86]:
#Items that should be ignore
items_ignored=df_raw[(df_raw['Jumlah'] <= 0)]
items_ignored = items_ignored.groupby(["Kode_Barang","Barang"])['Jumlah'].sum()
items_ignored.reset_index().sort_values(['Jumlah'],ascending=True)

    Kode_Barang                               Barang  Jumlah
260       84347  ROTATING SILVER ANGELS T-LIGHT HLDR -9369.0
17        20956                                    ?  -723.0
157       22588            CARD HOLDER GINGHAM HEART  -192.0
152       22574    HEART WOODEN CHRISTMAS DECORATION  -192.0
32        21232       STRAWBERRY CERAMIC TRINKET BOX  -148.0
..          ...                                  ...     ...
127       22331     WOODLAND PARTY BAG + STICKER SET    -1.0
130       22357             KINGS CHOICE BISCUIT TIN    -1.0
131       22371         AIRLINE BAG VINTAGE TOKYO 78    -1.0
104       22180                       RETROSPOT LAMP    -1.0
0         11001          ASSTD DESIGN RACING CAR PEN    -1.0

[292 rows x 3 columns]

## 2.	What is our strategy to increase sales based on our export destination countries?

In [74]:
#Look for country with the least number of purchase activities
top_country = df.groupby(["Negara"])['Jumlah'].sum()
top_country.reset_index().sort_values(['Jumlah'],ascending=True).head(10)

             Negara  Jumlah
2   Channel Islands    80.0
11      Netherlands    97.0
16      Switzerland   110.0
13           Poland   140.0
8             Italy   164.0
7           Iceland   319.0
0         Australia   321.0
3           Denmark   454.0
15            Spain   467.0
1           Belgium   528.0

We can consider some promotions and advertising activities to gain our sales activities in these least-purchase countries.

## 4.	Get the hidden insight from the data

In [75]:
top_country.reset_index().sort_values(['Jumlah'],ascending=False).head(10)

            Negara    Jumlah
17  United Kingdom  146933.0
4             EIRE    3886.0
6          Germany    3684.0
5           France    3577.0
12          Norway    3558.0
9            Japan    1672.0
14        Portugal     791.0
10       Lithuania     652.0
1          Belgium     528.0
15           Spain     467.0

In [81]:
# 4. Data transaction each month 
df['Revenue']=df['Jumlah']*df['Harga_Satuan']
df_rev = df.groupby(["Negara"])['Revenue'].sum()
df_rev.reset_index().sort_values(['Revenue'],ascending=False).head(10)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

            Negara    Revenue
17  United Kingdom  296427.98
6          Germany    7979.09
5           France    7336.94
4             EIRE    5851.13
9            Japan    4109.44
12          Norway    3777.04
14        Portugal    1976.47
10       Lithuania    1661.06
3          Denmark    1281.50
15           Spain     794.72